Public Attributes | List of all members
API_ToolBoxInfo Struct Reference
Toolbox
Contains information on the current state of the toolbox. More...
#include <APIdefs_Environment.h>
 Public Attributes
Int32  | nTools
number of tools installed (internal, subtypes)
API_ToolBoxItem **  | data
the tools themselves
API_ToolBoxItem  | activeTool
the tool which is currently active
Detailed Description
Contains information on the current state of the toolbox.
Remarks
Remember to dispose of the data handle.
Member Data Documentation
◆ activeTool
 API_ToolBoxInfo::activeTool
the tool which is currently active
◆ data
 API_ToolBoxInfo::data
the tools themselves
◆ nTools
 API_ToolBoxInfo::nTools
number of tools installed (internal, subtypes)